20260422T090303--kdoc-570-corsはサーバのリソースを保護しない__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-18T00:30:19Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 570: CORSはサーバのリソースを保護しない</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 570: CORSはサーバのリソースを保護しない</h1>
<div id="outline-container-orga888dc6" class="outline-2">
<h2 id="orga888dc6"><a href="#orga888dc6">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orga888dc6">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-05-19 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-05-19 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6893e3b" class="outline-2">
<h2 id="org6893e3b"><a href="#org6893e3b">概要</a></h2>
<div class="outline-text-2" id="text-org6893e3b">
<p>
CORSは <b>サーバ</b> のリソースを保護するものと誤って理解していた。正しくはブラウザを保護するものである。
</p>

<p>
<code>Access-Control-Allow-Origin</code> がサーバ側に設定されていても、ブラウザ以外のHTTPクライアントでは無視される。
</p>

<p>
例を示す。
</p>

<pre class="example" id="orga692b94">
GET /submit HTTP/1.1
Host: example.com
Origin: https://anywhere.com

Access-Control-Allow-Origin: https://example.com
</pre>

<p>
この場合、ブラウザは <code>Origin</code> が許可されていないため返ったレスポンスの読み取りを阻止する。しかし <code>curl</code> は同じリクエストでレスポンスをそのまま取得できる。
</p>
</div>
</div>
<div id="outline-container-org415a413" class="outline-2">
<h2 id="org415a413"><a href="#org415a413">関連</a></h2>
<div class="outline-text-2" id="text-org415a413">
<ul class="org-ul">
<li>追加調査: ではなんのためにあるのか。<a href="20260425T111716--kdoc-571-イメージレジストリにキャッシュを保存してビルドを高速化する__draft_permanent.html#ID-20260425T111716">KDOC 571: CORSはブラウザ側の仕組みでブラウザを保護するものであって、サーバを保護するものではない</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
